#include <stdio.h>

int main()
{
	int i = 4;
	double d = 3.14;
	char c = 'a';

	/* Ορίστε ένα δείκτη σε κάθε μία από τις τρεις μεταβλητές */

	/* Τυπώστε τις διευθύνσεις των δεικτών.  Χρησιμοποιείστε το
         προσδιοριστικό "%p" για την εκτύπωση διευθύνσεων μνήμης
         της μορφής '0xbe10a22f'. */

	/* Τυπώστε το μέγεθος της κατειλημμένης μνήμης για κάθε μία
         από τις 6 μεταβλητές (μεταβλητές και δείκτες).
         Χρησιμοποιείστε τον τελεστή sizeof. */

	/* Τυπώστε τις τιμές του περιεχομένου μνήμης */
	return 0;
} 
